data = {
"男鬼剑":["红眼","鬼泣","修罗","剑魂","剑影"],
"女鬼剑":["剑宗","剑魔","暗帝","剑帝"],
"男格斗":["男柔道","男气功","男街霸","武极"],
"女格斗":["女柔道","女气功","毒王","武神"],
"男枪手":["男漫游","男机械","男大枪","男弹药"],
"女枪手":["女漫游","女机械","女大枪","女弹药"],
"男法师":["魔皇","冰洁","血法","次元","风神"],
"女法师":["元素","召唤","战法","奶萝","魔道"],
"男圣职":["奶爸","驱魔","复仇者","蓝拳"],
"女圣职":["奶妈","巫女","异端审判者","诱魔者"],
"暗夜使者":["刺客","忍者","死灵","影舞者"],
"守护者":["龙神","帕拉丁","混沌魔灵","精灵骑士"],
"魔枪士":["光枪","暗枪","赵云","关羽"],
"外传":["黑暗武士","缔造"]
}    



emptydata = {
"男鬼剑":[],
"女鬼剑":[],
"男格斗":[],
"女格斗":[],
"男枪手":[],
"女枪手":[],
"男法师":[],
"女法师":[],
"男圣职":[],
"女圣职":[],
"暗夜使者":[],
"守护者":[],
"魔枪士":[],
"外传":[]
}   
